#https://www.codewars.com/kata/5679aa472b8f57fb8c000047/train/python
#بهذا المثال لازم نرجعلة القيمة الوسط اللي بيها يتساوى مجموع اليسرة واليمنى باللستة 
# اذا نطي [1,2,3,4,3,2,1]يطينا رقم 3 لان يم القيمة 4 تساوى الوسطين 
#20,10,30,10,10,15,35    يرجع 3
#20,10,-80,10,10,15,35    يرجع صفر 
#10,-80,10,10,15,35,20     يرجع ستة
#اذا متساوة باي حالة من الحالات حيرجع سالب واحد


def find_even_index(x):
    arr=x.split(",")
    ar=[eval(i) for i in arr]
    sum=0
    f=[]
    for idx, val in enumerate(ar):
        if idx == 0:                       #اذا القيمة هاي اول قيمة باللستة
            f.append(val)                 #فقط ضيف القيمة بلستة الاف
        else:
            f.append(f[idx-1]+val)               #اذا القيمة هاي مو اول قيمة باللستة ضيف القيمة ويا القيمة اللي بالاندكس الي قبلة 
        Sum += val                                              #sum=sum+val وبعدين اجمع القيمةويا المجموع الكلي

    for idx, val in enumerate(ar):
        t=0
        if idx !=0:
            t=f[idx-1]                  #ضيف القيمة اللي بالاندكس الي قبل هذا للتي
        if t==sum-f[idx-1]:                #بالنهاية اذا التي طلع يساوي السام قبل لنضيفلة القيمة اللي بالاندكس هذا 
            return idx
    return -1
   
  
        


x=input("Enter here: ")
print(find_even_index(x))